Revit 2027 API
ParameterTypeId.FireRating Property
 "Fire Rating"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FireRating { get; }
Public Shared ReadOnly Property FireRating As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FireRating {
	ForgeTypeId^ get ();
}
static member FireRating : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace